In [1]:
import pandas as pd
import numpy as np

In [2]:
# First we have to CREATE one python function because we will use the code later.

In [3]:
def salary_hike(x):
    if x>3000:
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x*1.5)

In [4]:
# Lets Create a Data Frame

In [5]:
df=pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                'Emp_Name':['Rajesh','Shankar','Vihaan','Saurav','Gaurav','Riya','Munmun','Rohit','Yashu','Garima'],
                'Salary':[4994,5455,6166,4044,3433,2922,6466,7877,6766,5155]})

In [6]:
df

   Dept Emp_Name  Salary
0     1   Rajesh    4994
1     2  Shankar    5455
2     3   Vihaan    6166
3     4   Saurav    4044
4     5   Gaurav    3433
5     6     Riya    2922
6     7   Munmun    6466
7     8    Rohit    7877
8     9    Yashu    6766
9    10   Garima    5155

In [7]:
# Lets add a new column name in the old dataframe

In [8]:
df['New Salary']=df['Salary'].apply(salary_hike)

In [9]:
df

   Dept Emp_Name  Salary  New Salary
0     1   Rajesh    4994      6493.0
1     2  Shankar    5455      7092.0
2     3   Vihaan    6166      8016.0
3     4   Saurav    4044      5258.0
4     5   Gaurav    3433      4463.0
5     6     Riya    2922      4383.0
6     7   Munmun    6466      8406.0
7     8    Rohit    7877     10241.0
8     9    Yashu    6766      8796.0
9    10   Garima    5155      6702.0

In [10]:
# lets add new column. Length of name

In [11]:
df['Name_Length']=df['Emp_Name'].apply(len)

In [12]:
df

   Dept Emp_Name  Salary  New Salary  Name_Length
0     1   Rajesh    4994      6493.0            6
1     2  Shankar    5455      7092.0            7
2     3   Vihaan    6166      8016.0            6
3     4   Saurav    4044      5258.0            6
4     5   Gaurav    3433      4463.0            6
5     6     Riya    2922      4383.0            4
6     7   Munmun    6466      8406.0            6
7     8    Rohit    7877     10241.0            5
8     9    Yashu    6766      8796.0            5
9    10   Garima    5155      6702.0            6

In [13]:
# Lets understand about how to use lambda function in our DataFrmae

In [14]:
=df['New Salary'].apply(lambda x:np.sqrt(x))

SyntaxError: invalid syntax (2710570300.py, line 1)

In [ ]:
df['sqrt']=df['New Salary'].apply(lambda x:np.sqrt(x))

In [ ]:
df

In [ ]:
#Print Minimum and Maximum of the column 'New_Salary' are:

In [ ]:
print("Min and Max of the column 'New Salary' are  : ",df['New Salary'].min()    ,  df['New Salary'].max())

In [ ]:
#Deletion, Sorting, List of Column and Rows Names

In [ ]:
print("\n Name of Column \n",'-'*20,sep="")
print(df.columns)

In [ ]:
#If we want to print the column name in List format.

In [ ]:
l=list(df.columns)
print("\n Column name in a list of String for later manipulation : ",l)

In [ ]:
#Deleting Column name from Data Frame

In [ ]:
print("\n Deleting Column by 'del' command \n",'-'*50,sep=' ')
del df['Salary']
print(df)

In [ ]:
df

In [ ]:
#Lets Create a new data frame for using  isnull(). function

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.DataFrame({'Name':['Ramesh','Raghav',np.nan,np.nan],
                'Gender':[np.nan,'M','M','F'],
                'Section':['A','B','C','D'],
                'Class':[5,12,np.nan,np.nan],
                'Phone_Number':[np.nan,9406289124,8349089124,np.nan],
                'Location':['Bengluru','Noida','Hyderabad',np.nan],
                'Email_Present':['Y','N',np.nan,np.nan],
                'Door_Number':[np.nan,444,555,345],
                'Street_Name':['ABC','DEF','GHI','XYZ'],
                'Pin_Code':[5,12,np.nan,np.nan],
                 'State':[np.nan,'Up','Telangana',np.nan],
                 'Dad_Name':['XYZ','DEF','GHI',np.nan]},dtype=int)

df

In [ ]:
len(df.columns)

In [ ]:
len(df.columns)

In [ ]:
#Use isnull Function

In [ ]:
df.isnull().sum()

In [ ]:
df.isnull().sum().sum()

In [ ]:
#Lets Start Using CSV File in Pandad

In [ ]:
import pandas as pd

In [ ]:
#How to import CSV File in Pandas

In [ ]:
ipl=pd.read_csv('matches.csv')

In [ ]:
ipl

In [ ]:
#If Your Want to see top 5   rows

In [ ]:
ipl.head()

In [ ]:
#If you want to see last 5 rows

In [ ]:
ipl.tail()

In [ ]:
#If You want to see any column Randomly

In [ ]:
ipl.sample(n=5)  #N is v=containing how much row you want

# Importing File Direct From Github

* Open any File in Github
* click on 'Raw' ('This will open the file in raw format)
* copy the link and paste as below

In [ ]:
ipl=pd.read_csv("https://raw.githubusercontent.com/s4sauravv/Datasets/main/matches.csv")

In [ ]:
ipl

In [ ]:
ipl.head()

In [ ]:
ipl.tail()

In [ ]:
#If you want to  know what is the shape of our DataFrame

In [ ]:
ipl.shape

In [ ]:
#Check Type of ipl

In [ ]:
type(ipl)

In [ ]:
ipl

In [ ]:
# If You Want to print all the rows you need to set as below and display the dataset

In [ ]:
pd.set_option('display.max_rows',None)

## Importing data from folders in your system

### Reading Excel Files

In [ ]:
#Name of Sheet to read from

In [ ]:
excel_file=pd.read_excel(r"C:\Users\safar\Downloads\matches (1).csv")

In [ ]:
excel_file

In [ ]:
del ipl['id']

In [ ]:
ipl

## Exporting Data

In [ ]:
#Export to current Folder

In [ ]:
ipl.to_csv('ipl_copy1.csv')

In [ ]:
#Export to different folder bu giving - Means which folder i want to save the copy ipl file

In [ ]:
ipl.to_csv(r"D:\CSV Files.csv",header=True,index=False)

# Work with Real Time Example

https://www.basketball-reference.com/leagues/NBA_2015_totals.html

In [ ]:
#when we have to use url to load dataframe from site

url='https://www.basketball-reference.com/leagues/NBA_2015_totals.html'

In [ ]:
BB_data=pd.read_html(url)

In [ ]:
BB_data

In [ ]:
BB_data[0].head()

In [ ]:
BB_data[0].tail()

In [ ]:
BB_data[0].sample(n=4) #we want 4 random rows

In [ ]:
BB_data[0].shape  # we are checking shapes

In [ ]:
BB_data[0].columns# we are checking columns

In [ ]:
BB_data[0][['Rk','Player','Pos']].head() # we use this method when we don't want all columns

In [ ]:
BB_data[0]

If You want to print all the rows ,you need to set as below and display the dataset

In [ ]:
pd.set_option('display.max_rows',None)

In [ ]:
# Any Number of rows, you want by writing as below

In [ ]:
pd.options.display.max_rows=4

# Data Time Manipulation

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
date_range=pd.date_range('4/12/2021',periods=12)
dates=pd.DataFrame(date_range,columns=['Date'])

In [ ]:
dates

In [ ]:
dates['Day']=dates['Date'].dt.day
dates['Month']=dates['Date'].dt.month
dates['Year']=dates['Date'].dt.year

In [ ]:
dates

In [ ]:
{'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']}

Example to convert object date into proper date format

In [ ]:
df=pd.DataFrame({'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']})

In [ ]:
df

In [ ]:
type(df)

### Visit https://docs.python.org/3/library/datetime.html

In [ ]:
df['Date']=pd.to_datetime(df['Date_Time'],format='%b %d %I:%M %p')

In [ ]:
df

In [ ]:
df['Day']=df['Date'].dt.day

In [ ]:
df['Month']=df['Date'].dt.month
df['Year']=df['Date'].dt.year
print(df)

In [ ]:
# You might wonder why it shows the year as 1990.  
# This happens because if the year is not available, the default year is set to 1900.